Revit 2027 API
ElementCategoryFilter(ElementId) Constructor
 Constructs a new instance of a filter to match elements by category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementCategoryFilter(
	ElementId categoryId
)
Public Sub New (
	categoryId As ElementId
)
public:
ElementCategoryFilter(
	ElementId^ categoryId
)
new :
        categoryId : ElementId -> ElementCategoryFilter
Parameters
categoryId ElementId
 The category id to match.
Exceptions
Exception | Condition
ArgumentException |  The category was not valid for filtering.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementCategoryFilter Class
ElementCategoryFilter Overload
Autodesk.Revit.DB Namespace